app/controllers/app_users_controller.rb

SELECT  "app_users".* FROM "app_users" WHERE "app_users"."user_id" = $1 LIMIT $2  [["user_id", 10030], ["LIMIT", 1]]
SELECT  "app_users".* FROM "app_users" WHERE (10030) LIMIT $1  [["LIMIT", 1]]
---
  def auto_login
    # params: user_id:int, token:string
    # 用过用户id来锁定用户
    @aim_user = AppUser.find_by(user_id: params[:user_id])
    if !@aim_user
      result = {"result":false, "error":3}
    elsif !@aim_user[:token].eql?(params[:token])
      result = {"result":false, "error":2}
    elsif @aim_user[:name].empty?

SELECT  "app_users".* FROM "app_users" WHERE "app_users"."user_id" = $1 LIMIT $2  [["user_id", 10003], ["LIMIT", 1]]
SELECT  1 AS one FROM "app_users" WHERE "app_users"."name" = $1 LIMIT $2  [["name", "qwer"], ["LIMIT", 1]]
---
  def user_profile_complete
    # params: user_id:int nickname:string birthday:string sex:int
    #         avatar:string avatar_format:string first_frame:string
    #         first_frame_format:string images:[content:string,
    #         content_format:string, first_frame:string,
    #         first_frame_format:string]
    AppUser.user_profile_complete params
    if AppUser.find_by(user_id: params[:user_id])[:name].empty?

UPDATE "app_users" SET "birthday" = $1, "avatar" = $2, "name" = $3, "sex" = $4, "updated_at" = $5 WHERE "app_users"."id" = $6  [["birthday", Thu, 23 Nov 2017], ["avatar", "app_users_images/10029/14788380200.jpg"], ["name", "test"], ["sex", "male"], ["updated_at", 2016-11-11 04:20:20 UTC], ["id", 29]]
---
  def manage_my_account
    AppUser.update_my_account params

SELECT  "app_users".* FROM "app_users" WHERE "app_users"."user_id" = $1 LIMIT $2  [["user_id", 10007], ["LIMIT", 1]]
UPDATE "app_users" SET "avatar" = $1, "updated_at" = $2 WHERE "app_users"."id" = $3  [["avatar", "./app_users_images/10007/14787555692.jpg"], ["updated_at", 2016-11-11 03:17:43 UTC], ["id", 7]]
---
  def update_my_avatar
    @aim_user = AppUser.find_by(user_id: params[:user_id].to_i)
    @aim_user.update_attribute(:avatar, "app_users_images/#{params[:user_id]}/#{params[:avatar]}")