app/controllers/email_account_users_controller.rb

SELECT  1 AS one FROM "app_users" WHERE "app_users"."account_name" = $1 LIMIT $2  [["account_name", "a@aa.a"], ["LIMIT", 1]]
INSERT INTO "app_users" ("user_id", "account_name", "password", "account_type", "token", "device_token", "reset_token_generated_time", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def email_account_sign_up
    # params email:string, password:string
    params[:email] = params[:email].downcase
    # B
    if AppUser.exists?(account_name: params[:email])
      result = {"result":false, "error":1, "user_id":"", "token":""}
    else
      created_result = AppUser.create_new_app_user_with_email(params)

SELECT  "app_users".* FROM "app_users" WHERE "app_users"."account_name" = $1 LIMIT $2  [["account_name", "test@test.com"], ["LIMIT", 1]]
UPDATE "app_users" SET "token" = $1, "updated_at" = $2 WHERE "app_users"."id" = $3  [["token", "54jCiCqS-wzJcl7EvVp0fg"], ["updated_at", 2016-11-11 00:50:33 UTC], ["id", 7]]
---
  def email_account_login
    # params email:string, password:string
    # 通过用户注册时候的email来锁定用户，可由唯一的昵称代替
    @aim_user = AppUser.find_by(account_name:params[:email].downcase)
    if !@aim_user
      result = {"result":false, "token":"", "user_id":"", "error":1}
    elsif !params[:password].eql?(@aim_user[:password])
      result = {"result":false, "token":"", "user_id":"", "error":3}
    elsif @aim_user[:name].empty?
      @aim_user.update_attribute(:token, SecureRandom.urlsafe_base64)